# ══════════════════════════════════════════════════════════════════════════════
# Brewfile - Declarative Package Management
# ══════════════════════════════════════════════════════════════════════════════
# Usage: brew bundle --file=~/.config/homebrew/Brewfile
# Dump current: brew bundle dump --file=~/.config/homebrew/Brewfile --force
#
# This file mirrors packages.common and packages.darwin from dotfiles.config.ts
# for users who prefer Homebrew's native bundle management.

# ─────────────────────────────────────────────────────────────────────────────
# Taps (Third-party repositories)
# ─────────────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ─────────────────────────────────────────────────────────────────────────────
# CLI Tools (Cross-platform via Homebrew/Linuxbrew)
# ─────────────────────────────────────────────────────────────────────────────

# Prompt
brew "starship"           # Cross-shell prompt

# Modern CLI replacements
brew "eza"                # Modern ls replacement
brew "fd"                 # Modern find replacement
brew "ripgrep"            # Fast grep replacement (rg)
brew "fzf"                # Fuzzy finder
brew "zoxide"             # Smarter cd command (z)

# Utilities
brew "jq"                 # JSON processor
brew "gh"                 # GitHub CLI
brew "tldr"               # Simplified man pages
brew "ncdu"               # Disk usage analyzer
brew "btop"               # Modern system monitor
brew "direnv"             # Per-directory environment variables
brew "fnm"                # Fast Node Manager

# ─────────────────────────────────────────────────────────────────────────────
# Optional CLI Tools (Uncomment as needed)
# ─────────────────────────────────────────────────────────────────────────────
# brew "bat"              # Cat with syntax highlighting
# brew "delta"            # Better git diffs
# brew "lazygit"          # Terminal UI for git
# brew "httpie"           # Modern curl alternative
# brew "duf"              # Modern df alternative
brew "dust"               # Modern du alternative
brew "atuin"              # Better shell history with sync
# brew "procs"            # Modern ps alternative
# brew "sd"               # Modern sed alternative
# brew "hyperfine"        # Command benchmarking
# brew "glow"             # Markdown renderer
# brew "age"              # Simple file encryption

# ─────────────────────────────────────────────────────────────────────────────
# macOS Casks (GUI applications - macOS only)
# ─────────────────────────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"   # Nerd Font for terminal icons
cask "ghostty"                     # Terminal emulator

# ─────────────────────────────────────────────────────────────────────────────
# Optional macOS Apps (Uncomment as needed)
# ─────────────────────────────────────────────────────────────────────────────
# cask "raycast"          # Spotlight replacement
# cask "rectangle"        # Window management
# cask "alt-tab"          # Windows-style alt-tab
# cask "stats"            # System monitor in menu bar
# cask "monitorcontrol"   # External monitor brightness control
# cask "karabiner-elements" # Keyboard customization

# ─────────────────────────────────────────────────────────────────────────────
# VS Code Extensions (Optional - uncomment if using VS Code)
# ─────────────────────────────────────────────────────────────────────────────
# vscode "github.copilot"
# vscode "vscodevim.vim"
# vscode "esbenp.prettier-vscode"
# vscode "dbaeumer.vscode-eslint"
